app/controllers/high_scores_controller.rb

  def index
    @high_scores = HighScore.all
---
SELECT * FROM `high_scores`

  def show
    @high_score = HighScore.find(params[:id])
---
SELECT * FROM `high_scores` WHERE (`high_scores`.`id` = 1)

  def edit
    @high_score = HighScore.find(params[:id])
---
SELECT * FROM `high_scores` WHERE (`high_scores`.`id` = 1)

  def create
    @high_score = HighScore.new(params[:high_score])

    respond_to do |format|
      if @high_score.save
---
INSERT INTO `high_scores` (`updated_at`, `playerName`, `created_at`, `game`, `score`) VALUES('2013-08-22 05:57:40', 'Bharath', '2013-08-22 05:57:40', 'Tennis', 6)

  def update
    @high_score = HighScore.find(params[:id])

    respond_to do |format|
      if @high_score.update_attributes(params[:high_score])
---
SELECT * FROM `high_scores` WHERE (`high_scores`.`id` = 1)
UPDATE `high_scores` SET `updated_at` = '2013-08-22 06:03:43', `playerName` = 'Bharath B' WHERE `id` = 1